Revit 2024 API
OffsetSurface.GetOffsetDistance Method
 Returns offset distance of this OffsetSurface.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2021
Syntax
C#
public double GetOffsetDistance()
Visual Basic
Public Function GetOffsetDistance As Double
Visual C++
public:
double GetOffsetDistance()
Return Value
 Offset distance of this OffsetSurface.
See Also
OffsetSurface Class
Autodesk.Revit.DB Namespace